{
  "_class_name": "FlaxStableDiffusionPipeline",
  "_diffusers_version": "0.16.0.dev0",
  "feature_extractor": [
    "transformers",
    "CLIPFeatureExtractor"
  ],
  "safety_checker": [
    "stable_diffusion",
    "FlaxStableDiffusionSafetyChecker"
  ],
  "scheduler": [
    "diffusers",
    "FlaxPNDMScheduler"
  ],
  "text_encoder": [
    "transformers",
    "FlaxCLIPTextModel"
  ],
  "tokenizer": [
    "transformers",
    "CLIPTokenizer"
  ],
  "unet": [
    "diffusers",
    "FlaxUNet2DConditionModel"
  ],
  "vae": [
    "diffusers",
    "FlaxAutoencoderKL"
  ]
}
